In [1]:
import pandas as pd

In [29]:
data_1 = pd.DataFrame({
        "Location": ["Lagos","Rivers", "Sokoto","Anambra","Abia"],
        "Performance":[0.76, 0.83,0.70, 0.67, 0.90]
})

In [30]:
data_1

  Location  Performance
0    Lagos         0.76
1   Rivers         0.83
2   Sokoto         0.70
3  Anambra         0.67
4     Abia         0.90

In [31]:
data_2 = pd.DataFrame({
        "Location":["Lagos", "Sokoto", "Abia"],
        "KPI": [50,79,74]
})

In [32]:
data_2

  Location  KPI
0    Lagos   50
1   Sokoto   79
2     Abia   74

In [33]:
data_3 = pd.merge(data_1,data_2,on="Location", how="outer")

In [34]:
data_3

  Location  Performance   KPI
0    Lagos         0.76  50.0
1   Rivers         0.83   NaN
2   Sokoto         0.70  79.0
3  Anambra         0.67   NaN
4     Abia         0.90  74.0

In [35]:
data_4 = pd.DataFrame({
        "Location":["Bauchi", "Benue","Crossriver"],
        "Performance":[0.80,0.79,0.80]
})

In [36]:
data_4

     Location  Performance
0      Bauchi         0.80
1       Benue         0.79
2  Crossriver         0.80

In [43]:
data_5 =pd.merge(data_1,data_4,on=["Location","Performance"], how = "outer")

In [44]:
data_5

     Location  Performance
0       Lagos         0.76
1      Rivers         0.83
2      Sokoto         0.70
3     Anambra         0.67
4        Abia         0.90
5      Bauchi         0.80
6       Benue         0.79
7  Crossriver         0.80